Repository: UlinduRasantha/SignBridge
Catalog: MobileApp/lib/l10n/app_*.arb
Languages: si

# locale
source: en
si: si

source: App Language
si: යෙදුම් භාෂාව

source: Suggested
si: යෝජිත

source: All Languages
si: සියලුම භාෂා

source: Sinhala
si: සිංහල

# englishUs
source: English (United States)
si: ඉංග්‍රීසි (එක්සත් ජනපදය)

source: Sign Bridge
si: සයින් බ්‍රිජ්

source: Welcome
si: පිළිගැනීම

source: Welcome to Sign Bridge
si: Sign Bridge වෙත ඔබව සාදරයෙන් පිළිගනිමු

source: Sign In
si: පිවිසෙන්න

source: Sign Out
si: ඉවත් වන්න

source: Log In
si: ලොග් වන්න

source: Login with Google
si: Google සමග ලොග් වන්න

source: Back
si: ආපසු

source: Home
si: මුල් පිටුව

source: Settings
si: සැකසුම්

source: User Guide
si: පරිශීලක මාර්ගෝපදේශය

source: Profile
si: පැතිකඩ

source: About
si: පිළිබඳ

source: Language
si: භාෂාව

source: Change Language
si: භාෂාව වෙනස් කරන්න

source: English
si: ඉංග්‍රීසි

source: Save
si: සුරකින්න

source: Cancel
si: අවලංගු කරන්න

source: Exit App
si: යෙදුමෙන් පිටවෙන්න

source: Are you sure you want to exit?
si: ඔබට පිටවීමට අවශ්‍ය බව සහතිකද?

source: Yes
si: ඔව්

source: No
si: නැත

source: Sign to Text Translate
si: සංඥාවෙන් පෙළට පරිවර්තනය

source: Start Translation
si: පරිවර්තනය ආරම්භ කරන්න

source: Camera
si: කැමරාව

source: The sign will appear here
si: සංඥාව මෙහි දිස් වනු ඇත

source: Text
si: පෙළ

source: Download
si: බාගත කරන්න

source: Share
si: බෙදාගන්න

source: Processing gesture...
si: අභිනය සැකසෙමින් පවතී...

source: Detecting sign...
si: සංඥාව හඳුනාගනිමින්...

source: No gesture detected
si: අභිනයක් හඳුනාගත්තේ නැත

source: Please keep your hands visible
si: කරුණාකර ඔබේ දෑත් දර්ශනය වන ලෙස තබා ගන්න

source: Gesture detected successfully
si: අභිනය සාර්ථකව හඳුනාගන්නා ලදී

source: Translating to text...
si: පෙළට පරිවර්තනය කරමින්...

source: Translation complete
si: පරිවර්තනය සම්පූර්ණයි

source: Text to Sign Translate
si: පෙළින් සංඥාවට පරිවර්තනය

source: Enter your text
si: ඔබේ පෙළ ඇතුළු කරන්න

source: Play Gesture
si: අභිනය පෙන්වන්න

source: Stop
si: නවත්වන්න

source: Reset
si: නැවත සකසන්න

source: Avatar is signing...
si: අවතාරය සංඥා කරමින් සිටී...

source: Display Sign
si: සංඥාව පෙන්වන්න

source: How to use the Sign Bridge app
si: Sign Bridge යෙදුම භාවිතා කරන්නේ කෙසේද

# step1OpenTheAppAndSignIn
source: Step 1: Open the app and sign in with Google or Email.
si: පියවර 1: යෙදුම විවෘත කර Google හෝ විද්‍යුත් තැපෑල සමඟින් පිවිසෙන්න.

# step2SelectSignToTextMode
source: Step 2: Select 'Sign to Text' mode from the home screen.
si: පියවර 2: මුල් තිරයෙන් 'සංඥාවෙන් පෙළට' මාදිලිය තෝරන්න.

# step3PositionYourHandsClearly
source: Step 3: Position your hands clearly in front of the camera.
si: පියවර 3: කැමරාව ඉදිරිපිට ඔබේ දෑත් පැහැදිලිව තබන්න.

# step4TapStartTranslation
source: Step 4: Tap 'Start Translation' button to begin detection.
si: පියවර 4: හඳුනාගැනීම ආරම්භ කිරීමට 'පරිවර්තනය ආරම්භ කරන්න' බොත්තම ඔබන්න.

# step5TheDetectedSignWillConvert
source: Step 5: The detected sign will automatically convert to text.
si: පියවර 5: හඳුනාගත් සංඥාව ස්වයංක්‍රීයව පෙළට පරිවර්තනය වනු ඇත.

# step6YouCanDownloadOrShare
source: Step 6: You can download or share the translated text.
si: පියවර 6: ඔබට පරිවර්තනය කළ පෙළ බාගත කිරීමට හෝ බෙදා ගැනීමට හැකිය.

source: How to use Text to Sign mode
si: පෙළින් සංඥාවට මාදිලිය භාවිතා කරන්නේ කෙසේද

# enterTheTextInTheInputBox
source: Enter the text in the input box and tap the 'Play Gesture' button.
si: ආදාන කොටුවේ පෙළ ඇතුළු කර 'අභිනය පෙන්වන්න' බොත්තම ඔබන්න.

# theAvatarWillShowTheSign
source: The avatar will show the sign language animatedly.
si: අවතාරය සජීවීකරණයෙන් සංඥා භාෂාව පෙන්වනු ඇත.

source: Settings and Customization
si: සැකසුම් සහ අභිරුචිකරණය

# changeLanguageBetweenEnglishAndSinhalaSetting
source: You can switch between English and Sinhala languages at any time.
si: ඔබට ඕනෑම වේලාවක ඉංග්‍රීසි සහ සිංහල භාෂා අතර මාරු විය හැක.

# enableDarkModeForBetterVisibility
source: Enable dark mode for better visibility at night.
si: රාත්‍රියේ වඩා හොඳ දෘශ්‍යතාව සඳහා අඳුරු මාදිලිය සක්‍රිය කරන්න.

# useTheHelpSectionForSupport
source: Use the Help section for troubleshooting and support.
si: දෝෂ නිරාකරණය සහ සහාය සඳහා උපකාරක කොටස භාවිතා කරන්න.

source: Loading...
si: පූරණය වෙමින්...

source: Please wait
si: කරුණාකර රැඳී සිටින්න

source: Processing...
si: සැකසෙමින්...

source: Connecting to server...
si: සේවාදායකයට සම්බන්ධ වෙමින්...

source: No Internet Connection
si: අන්තර්ජාල සම්බන්ධතාවක් නැත

source: Please check your network connection
si: කරුණාකර ඔබේ ජාල සම්බන්ධතාවය පරීක්ෂා කරන්න

source: Camera permission denied
si: කැමරා අවසරය ප්‍රතික්ෂේප කර ඇත

source: Please allow camera access in settings
si: කරුණාකර සැකසුම් තුළ කැමරා ප්‍රවේශයට ඉඩ දෙන්න

source: Microphone permission required
si: මයික්‍රොෆෝන අවසරය අවශ්‍යයි

source: Failed to Load Data
si: දත්ත පැටවීමට අසමත් විය

source: Something went wrong
si: යමක් වැරදී ඇත

source: Try Again
si: නැවත උත්සාහ කරන්න

source: Update available
si: යාවත්කාලීන කිරීමක් තිබේ

source: App updated successfully
si: යෙදුම සාර්ථකව යාවත්කාලීන කරන ලදී

source: Login successful
si: සාර්ථකව පිවිසීම

source: Invalid email or password
si: වලංගු නොවන විද්‍යුත් තැපෑල හෝ මුරපදය

source: Please fill all required fields
si: කරුණාකර සියලුම අවශ්‍ය ක්ෂේත්‍ර පුරවන්න

source: Password must be at least 8 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 8 ක් විය යුතුය

source: Account Created Successfully
si: ගිණුම සාර්ථකව නිර්මාණය කරන ලදී

source: Logging out...
si: ඉවත් වෙමින්...

source: Are you sure you want to log out?
si: ඔබට ඉවත් වීමට අවශ්‍ය බව සහතිකද?

source: Gesture detection failed
si: අභිනය හඳුනාගැනීම අසාර්ථක විය

source: Model not loaded properly
si: මාදිලිය නිසියාකාරව පූරණය වී නැත

source: Restart the app and try again
si: යෙදුම නැවත ආරම්භ කර නැවත උත්සාහ කරන්න

source: File saved successfully
si: ගොනුව සාර්ථකව සුරැකිණි

source: File not found
si: ගොනුව සොයාගත නොහැක

source: Do you want to delete this file?
si: ඔබට මෙම ගොනුව මකා දැමීමට අවශ්‍යද?

source: File deleted successfully
si: ගොනුව සාර්ථකව මකා දමන ලදී

source: Welcome Back
si: නැවත පිළිගනිමු

source: Detecting hands...
si: දෑත් හඳුනාගනිමින්...

source: Analyzing gesture...
si: අභිනය විශ්ලේෂණය කරමින්...

source: Processing video frames
si: වීඩියෝ රාමු සැකසීම

source: Gesture recognized as:
si: අභිනය හඳුනාගත්තේ මෙලෙස:

# noGestureDetectedFull
source: No gesture detected
si: අභිනයක් හඳුනාගත්තේ නැත

source: Move your hands into the frame
si: ඔබේ දෑත් රාමුව තුළට ගෙන එන්න

source: Hold the gesture steady
si: අභිනය ස්ථාවරව තබා ගන්න

source: Capturing gesture data
si: අභිනය දත්ත ග්‍රහණය කරමින්

source: Please wait while we recognize your sign
si: අපි ඔබේ සංඥාව හඳුනාගන්නා තෙක් කරුණාකර රැඳී සිටින්න

source: Session expired. Please log in again.
si: සැසිය කල් ඉකුත් වී ඇත. කරුණාකර නැවත ලොග් වන්න.

source: Gesture translation completed
si: අභිනය පරිවර්තනය සම්පූර්ණයි

source: Prediction:
si: අනාවැකිය:

source: Confidence Level
si: විශ්වාසනීය මට්ටම

source: Recording gesture sample...
si: අභිනය සාම්පලයක් පටිගත කරමින්...

source: Saved sample successfully
si: සාම්පලය සාර්ථකව සුරැකිණි

source: Collecting dataset
si: දත්ත කට්ටලය එකතු කරමින්

source: Sequence completed
si: අනුක්‍රමය සම්පූර්ණයි

source: Model loading...
si: මාදිලිය පූරණය වෙමින්...

source: Model loaded successfully
si: මාදිලිය සාර්ථකව පූරණය කරන ලදී

source: Preparing camera...
si: කැමරාව සූදානම් කරමින්...

source: Gesture translation started
si: අභිනය පරිවර්තනය ආරම්භ විය

source: Gesture translation stopped
si: අභිනය පරිවර්තනය නතර විය

source: Detected word:
si: හඳුනාගත් වචනය:

source: Unknown sign
si: නොදන්නා සංඥාව

source: Please perform the sign again
si: කරුණාකර සංඥාව නැවත සිදු කරන්න

source: Left hand detected
si: වම් අත හඳුනාගන්නා ලදී

source: Right hand detected
si: දකුණු අත හඳුනාගන්නා ලදී

source: Both hands detected
si: දෙඅතම හඳුනාගන්නා ලදී

source: No hands detected
si: දෑත් හඳුනාගත්තේ නැත

source: Tracking movement
si: චලනය නිරීක්ෂණය කරමින්

source: Gesture not clear
si: අභිනය පැහැදිලි නැත

source: Try with better lighting
si: වඩා හොඳ ආලෝකයකින් උත්සාහ කරන්න

source: Gesture too fast, please slow down
si: අභිනය ඉතා වේගවත්ය, කරුණාකර වේගය අඩු කරන්න

source: Gesture too far from camera
si: අභිනය කැමරාවට වඩා දුර වැඩිය

source: Gesture too close to camera
si: අභිනය කැමරාවට වඩා ළඟ වැඩිය

source: Adjust your position
si: ඔබේ පිහිටීම සකස් කරන්න

source: Lighting conditions not suitable
si: ආලෝක තත්ත්වයන් සුදුසු නැත

source: Calibrating gesture detection
si: අභිනය හඳුනාගැනීම ක්‍රමාංකනය කරමින්

source: Gesture captured
si: අභිනය ග්‍රහණය කර ගන්නා ලදී

source: Gesture not recognized
si: අභිනය හඳුනාගත්තේ නැත

source: Please stay still while detecting
si: හඳුනාගැනීමේදී කරුණාකර නිශ්චලව සිටින්න

source: Starting real-time recognition
si: තත්‍ය කාලීන හඳුනාගැනීම ආරම්භ කරමින්

source: Real-time translation active
si: තත්‍ය කාලීන පරිවර්තනය සක්‍රීයයි

source: Sign Bridge AI Model Active
si: Sign Bridge AI මාදිලිය සක්‍රීයයි

source: End of session
si: සැසිය අවසන් කිරීම

source: Re-calibrating camera
si: කැමරාව නැවත ක්‍රමාංකනය කරමින්

source: Hello
si: හෙලෝ

source: Login
si: පිවිසීම

source: Logout
si: ඉවත් වීම

source: Sign Up
si: ලියාපදිංචි වන්න

source: Register
si: ලියාපදිංචි වන්න

source: Username
si: පරිශීලක නාමය

source: Password
si: මුරපදය

# confirmPasswordInput
source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# forgotPasswordQuestion
source: Forgot Password?
si: මුරපදය අමතකද?

source: Reset Password
si: මුරපදය යළි සකසන්න

source: Email Address
si: විද්‍යුත් තැපැල් ලිපිනය

# enterYourEmail
source: Enter your email address
si: ඔබේ විද්‍යුත් තැපැල් ලිපිනය ඇතුළු කරන්න

source: Enter your password
si: ඔබේ මුරපදය ඇතුළු කරන්න

source: Invalid email address
si: වලංගු නොවන විද්‍යුත් තැපැල් ලිපිනය

source: Invalid password
si: වලංගු නොවන මුරපදය

source: Please enter a valid email
si: කරුණාකර වලංගු විද්‍යුත් තැපෑලක් ඇතුළු කරන්න

source: Please wait a moment
si: කරුණාකර මොහොතක් රැඳී සිටින්න

# loadingDots
source: Loadingâ€¦
si: පූරණය වෙමින්…

source: Dashboard
si: මුල් පාලක පුවරුව

source: My Profile
si: මගේ පැතිකඩ

source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න

source: Save Changes
si: වෙනස්කම් සුරකින්න

source: Delete
si: මකන්න

# confirmDialog
source: Confirm
si: තහවුරු කරන්න

source: Are you sure?
si: ඔබට විශ්වාසද?

source: OK
si: හරි

source: Submit
si: ඉදිරිපත් කරන්න

# continueForward
source: Continue
si: ඉදිරියට යන්න

source: Next
si: ඊළඟ

source: Retry
si: නැවත උත්සාහ කරන්න

source: Error
si: දෝෂය

source: Warning
si: අනතුරු ඇඟවීම

source: Information
si: තොරතුරු

source: Success
si: සාර්ථකයි

source: Upload
si: උඩුගත කරන්න

source: Select File
si: ගොනුවක් තෝරන්න

source: Choose Image
si: රූපයක් තෝරන්න

source: Capture Photo
si: ඡායාරූපයක් ගන්න

source: Gallery
si: ගැලරිය

source: Search
si: සොයන්න

source: Result Not Found
si: ප්‍රතිඵලයක් හමු නොවීය

source: Please try again later
si: කරුණාකර පසුව නැවත උත්සාහ කරන්න

source: Please check your connection
si: කරුණාකර ඔබේ සම්බන්ධතාවය පරීක්ෂා කරන්න

source: Connection Error
si: සම්බන්ධතා දෝෂය

source: Sign In with Google
si: Google සමඟින් පිවිසෙන්න

source: Sign In with Facebook
si: Facebook සමඟින් පිවිසෙන්න

source: Sign In with Email
si: විද්‍යුත් තැපෑල සමඟින් පිවිසෙන්න

source: Continue with Google
si: Google සමඟින් ඉදිරියට යන්න

source: Continue with Email
si: විද්‍යුත් තැපෑල සමඟින් ඉදිරියට යන්න

source: Or
si: හෝ

source: Create an Account
si: ගිණුමක් සාදන්න

source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Don't have an account?
si: ගිණුමක් නැතිද?

source: Remember Me
si: මා මතක තබා ගන්න

source: Forgot Username?
si: පරිශීලක නාමය අමතකද?

# changeLanguageSetting
source: Change Language
si: භාෂාව වෙනස් කරන්න

# selectLanguageSetting
source: Select Language
si: භාෂාව තෝරන්න

# englishLang
source: English
si: ඉංග්‍රීසි

# sinhalaLangFull
source: Sinhala
si: සිංහල

# tamilLang
source: Tamil
si: දෙමළ

source: Dark Mode
si: අඳුරු මාදිලිය

source: Light Mode
si: ආලෝක මාදිලිය

source: Theme
si: තේමාව

source: Notifications
si: දැනුම්දීම්

source: Enable Notifications
si: දැනුම්දීම් සක්‍රිය කරන්න

source: Disable Notifications
si: දැනුම්දීම් අක්‍රිය කරන්න

# aboutFull
source: About
si: පිළිබඳ

source: About Us
si: අප ගැන

source: Contact Us
si: අප හා සම්බන්ධ වන්න

source: Send Message
si: පණිවිඩය යවන්න

source: Message
si: පණිවිඩය

source: Subject
si: විෂය

source: Name
si: නම

source: Full Name
si: සම්පූර්ණ නම

source: First Name
si: මුල් නම

source: Last Name
si: අවසාන නම

source: Address
si: ලිපිනය

source: Phone Number
si: දුරකථන අංකය

source: Mobile Number
si: ජංගම දුරකථන අංකය

source: Update
si: යාවත්කාලීන කරන්න

source: Updated Successfully
si: සාර්ථකව යාවත්කාලීන කරන ලදී

source: Successfully Submitted
si: සාර්ථකව ඉදිරිපත් කරන ලදී

# pleaseFillAllRequiredFieldsFull
source: Please fill all required fields
si: කරුණාකර සියලුම අවශ්‍ය ක්ෂේත්‍ර පුරවන්න

# requiredFieldText
source: Required Field
si: අවශ්‍ය ක්ෂේත්‍රය

# invalidInputText
source: Invalid Input
si: වලංගු නොවන ආදානය

source: Field cannot be empty
si: ක්ෂේත්‍රය හිස් විය නොහැක

source: Tap to continue
si: ඉදිරියට යාමට තට්ටු කරන්න

source: Swipe to learn more
si: වැඩි විස්තර දැන ගැනීමට ස්වයිප් කරන්න

source: Skip
si: මඟ හරින්න

source: Finish
si: අවසන් කරන්න

source: Loading Data
si: දත්ත පූරණය වෙමින්

source: Data Loaded Successfully
si: දත්ත සාර්ථකව පූරණය කරන ලදී

source: No Data Available
si: දත්ත නොමැත

source: Fetching Data
si: දත්ත ලබා ගනිමින්

source: Updating...
si: යාවත්කාලීන කරමින්...

# processingCurrent
source: Processing...
si: සැකසෙමින්...

source: Uploading...
si: උඩුගත කරමින්...

source: Downloading...
si: බාගත කරමින්...

source: Sending...
si: යවමින්...

source: Receiving...
si: ලබා ගනිමින්...

source: Completed
si: සම්පූර්ණයි

source: Operation Failed
si: මෙහෙයුම අසාර්ථක විය

source: Please check your input
si: කරුණාකර ඔබේ ආදානය පරීක්ෂා කරන්න

source: Invalid username or password
si: වලංගු නොවන පරිශීලක නාමය හෝ මුරපදය

source: Account Deleted
si: ගිණුම මකා දමන ලදී

source: Account Settings
si: ගිණුම් සැකසුම්

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

source: Terms and Conditions
si: නියමයන් සහ කොන්දේසි

source: Accept
si: පිළිගන්න

source: Decline
si: ප්‍රතික්ෂේප කරන්න

source: View Details
si: විස්තර බලන්න

source: Details
si: විස්තර

source: Description
si: විස්තරය

source: Category
si: ප්‍රවර්ගය

source: Select Category
si: ප්‍රවර්ගය තෝරන්න

source: Choose Category
si: ප්‍රවර්ගයක් තෝරන්න

source: Date
si: දිනය

source: Time
si: වේලාව

source: Duration
si: කාලය

source: Start
si: ආරම්භ කරන්න

source: Pause
si: විරාම කරන්න

source: Resume
si: නැවත පටන් ගන්න

source: Play
si: ධාවනය කරන්න

source: Record
si: පටිගත කරන්න

source: Recording
si: පටිගත කරමින්

source: Recorded Successfully
si: සාර්ථකව පටිගත කරන ලදී

source: Delete Record
si: පටිගත කිරීම මකන්න

source: View History
si: ඉතිහාසය බලන්න

source: History
si: ඉතිහාසය

source: Recent
si: මෑත

source: Today
si: අද

source: Yesterday
si: ඊයේ

source: This Week
si: මෙම සතිය

source: Last Week
si: පසුගිය සතිය

source: This Month
si: මෙම මාසය

source: Last Month
si: පසුගිය මාසය

source: This Year
si: මෙම වසර

source: Last Year
si: පසුගිය වසර

source: Upcoming
si: ඉදිරි

source: Completed Tasks
si: සම්පූර්ණ කළ කාර්යයන්

source: Pending Tasks
si: ඉතිරි කාර්යයන්

source: In Progress
si: ක්‍රියාත්මක වෙමින් පවතී

# successNoun
source: Success
si: සාර්ථකත්වය

source: Failure
si: අසාර්ථකත්වය

# errorNoun
source: Error
si: දෝෂය

# warningNoun
source: Warning
si: අනතුරු ඇඟවීම

# informationNoun
source: Information
si: තොරතුරු

# messageNoun
source: Message
si: පණිවිඩය

source: Notification
si: දැනුම්දීම

source: New Notification
si: නව දැනුම්දීම

source: Clear All
si: සියල්ල හිස් කරන්න

source: Mark as Read
si: කියවූ ලෙස සලකුණු කරන්න

source: Mark as Unread
si: නොකියවූ ලෙස සලකුණු කරන්න

source: View More
si: තවත් බලන්න

source: Show Less
si: අඩු පෙන්වන්න

source: Show More
si: තවත් පෙන්වන්න

source: Open
si: විවෘත කරන්න

source: Close
si: වසන්න

source: Exit
si: පිටවෙන්න

# logoutVerb
source: Logout
si: ඉවත් වන්න

# loginVerb
source: Login
si: පිවිසෙන්න

# signInVerb
source: Sign In
si: පිවිසෙන්න

# signOutVerb
source: Sign Out
si: ඉවත් වන්න

# registerVerb
source: Register
si: ලියාපදිංචි වන්න

# signUpVerb
source: Sign Up
si: ලියාපදිංචි වන්න

# nextAdj
source: Next
si: ඊළඟ

source: Previous
si: පෙර

# backVerb
source: Back
si: ආපසු

source: Forward
si: ඉදිරියට

source: Go Home
si: මුල් පිටුවට යන්න

# saveChangesVerb
source: Save Changes
si: වෙනස්කම් සුරකින්න

source: Discard Changes
si: වෙනස්කම් ඉවතලන්න

source: Edit
si: සංස්කරණය කරන්න

# deleteVerb
source: Delete
si: මකන්න

source: Remove
si: ඉවත් කරන්න

# updateVerb
source: Update
si: යාවත්කාලීන කරන්න

# confirmVerb
source: Confirm
si: තහවුරු කරන්න

source: Apply
si: යොදන්න

# submitVerb
source: Submit
si: ඉදිරිපත් කරන්න

# retryVerb
source: Retry
si: නැවත උත්සාහ කරන්න

source: Refresh
si: නැවත පූරණය කරන්න

source: Change Password
si: මුරපදය වෙනස් කරන්න

source: Forgot Password
si: මුරපදය අමතකද

source: Create New Password
si: නව මුරපදයක් සාදන්න

source: Enter Password
si: මුරපදය ඇතුළු කරන්න

source: Password Updated Successfully
si: මුරපදය සාර්ථකව යාවත්කාලීන කරන ලදී

# profileNoun
source: Profile
si: පැතිකඩ

source: View Profile
si: පැතිකඩ බලන්න

# editProfileVerb
source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න

source: Update Profile
si: පැතිකඩ යාවත්කාලීන කරන්න

# changeLanguageAction
source: Change Language
si: භාෂාව වෙනස් කරන්න

# selectLanguageAction
source: Select Language
si: භාෂාව තෝරන්න

# englishLangName
source: English
si: ඉංග්‍රීසි

# sinhalaLangName
source: Sinhala
si: සිංහල

# tamilLangName
source: Tamil
si: දෙමළ

# lightModeFull
source: Light Mode
si: ආලෝක මාදිලිය

# themeSetting
source: Theme
si: තේමාව

# settingsGeneral
source: Settings
si: සැකසුම්

source: App Settings
si: යෙදුම් සැකසුම්

source: System Settings
si: පද්ධති සැකසුම්

# aboutGeneral
source: About
si: පිළිබඳ

source: About App
si: යෙදුම පිළිබඳ

source: Version
si: අනුවාදය

source: Help
si: උදව්

source: Support
si: සහාය

# contactUsGeneral
source: Contact Us
si: අප හා සම්බන්ධ වන්න

# sendMessageAction
source: Send Message
si: පණිවිඩය යවන්න

source: Message Sent Successfully
si: පණිවිඩය සාර්ථකව යවන ලදී

source: Message Failed
si: පණිවිඩය අසාර්ථක විය

source: Thank You
si: ස්තූතියි

source: Thank You for Using Our App
si: අපගේ යෙදුම භාවිතා කිරීම ගැන ඔබට ස්තූතියි

# pleaseWaitFull
source: Please Wait
si: කරුණාකර රැඳී සිටින්න

# loadingDataFull
source: Loading Data
si: දත්ත පූරණය වෙමින්

source: Fetching Information
si: තොරතුරු ලබා ගනිමින්

source: Processing Request
si: ඉල්ලීම සැකසෙමින්

# noDataAvailableFull
source: No Data Available
si: දත්ත නොමැත

# noInternetConnectionFull
source: No Internet Connection
si: අන්තර්ජාල සම්බන්ධතාවක් නැත

source: Try Again Later
si: පසුව නැවත උත්සාහ කරන්න

# connectionErrorFull
source: Connection Error
si: සම්බන්ධතා දෝෂය

source: Network Timeout
si: ජාල කාලය ඉක්මවා ඇත

source: Data Saved Successfully
si: දත්ත සාර්ථකව සුරැකිණි

source: Data Deleted Successfully
si: දත්ත සාර්ථකව මකා දමන ලදී

source: Invalid Input
si: වලංගු නොවන ආදානය

source: Required Field
si: අවශ්‍ය ක්ෂේත්‍රය

source: Please Fill All Fields
si: කරුණාකර සියලුම ක්ෂේත්‍ර පුරවන්න

source: Please Enter Valid Information
si: කරුණාකර වලංගු තොරතුරු ඇතුළු කරන්න

source: Session Expired
si: සැසිය කල් ඉකුත් වී ඇත

source: Unauthorized Access
si: අනවසර ප්‍රවේශය

source: Permission Denied
si: අවසරය ප්‍රතික්ෂේප කරන ලදී

source: Unknown Error
si: නොදන්නා දෝෂයක්

source: Operation Successful
si: මෙහෙයුම සාර්ථකයි

# operationFailedFull
source: Operation Failed
si: මෙහෙයුම අසාර්ථක විය

# areYouSureFull
source: Are you sure?
si: ඔබට විශ්වාසද?

source: Do you want to continue?
si: ඔබට ඉදිරියට යාමට අවශ්‍යද?

source: Confirm Action
si: ක්‍රියාව තහවුරු කරන්න

# yesAffirmative
source: Yes
si: ඔව්

# noNegative
source: No
si: නැත

# okAffirmative
source: OK
si: හරි

source: Done
si: නිමයි

# welcomeBackMessage
source: Welcome Back
si: නැවත පිළිගනිමු

source: Good Morning
si: සුබ උදෑසනක්

source: Good Afternoon
si: සුබ දහවල්

source: Good Evening
si: සුබ සන්ධ්‍යාවක්

source: Good Night
si: සුබ රාත්‍රියක්

source: See You Soon
si: නැවත හමු වෙමු

source: Goodbye
si: ආයුබෝවන්

# exitAppAction
source: Exit App
si: යෙදුමෙන් පිටවෙන්න

source: Rate Us
si: අප ශ්‍රේණිගත කරන්න

source: Share App
si: යෙදුම බෙදාගන්න

source: Feedback
si: ප්‍රතිපෝෂණය

source: Submit Feedback
si: ප්‍රතිපෝෂණය ඉදිරිපත් කරන්න

source: Thank You for Your Feedback
si: ඔබගේ ප්‍රතිපෝෂණයට ස්තූතියි

# termsAndConditionsPolicy
source: Terms and Conditions
si: නියමයන් සහ කොන්දේසි

# privacyPolicyFull
source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

# acceptPolicy
source: Accept
si: පිළිගන්න

# declinePolicy
source: Decline
si: ප්‍රතික්ෂේප කරන්න

source: Please try again
si: කරුණාකර නැවත උත්සාහ කරන්න

# confirmPasswordFull
source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# resetVerb
source: Reset
si: යළි සකසන්න

# continueVerb
source: Continue
si: ඉදිරියට යන්න
